Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/leaving_ireland/moving_abroad_from_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Moving abroad from Ireland
ga: Ag bogadh thar lear ó Éirinn

source: If you are planning to move abroad, you can prepare yourself in advance by getting as much information as possible about the country to which you are travelling
ga: Má tá tú ar intinn bogadh thar lear, is féidir leat ullmhú roimh ré tríd an oiread eolais agus is féidir a fháil faoin tír atá mar cheann scríbe agat

source: You can search for this information online and also get information from your travel agent or the embassy of the relevant country
ga: Is féidir leat an t-eolas seo a chuardach ar líne agus eolas a fháil ó do ghníomhaire taistil nó ambasáid na tíre ábhartha

source: You can use the library and, if possible, get in touch with people who have lived there previously
ga: Is féidir leat an leabharlann a úsáid agus, más féidir, socrú a dhéanamh chun casadh le daoine a bhí ina gcónaí ann cheana féin

source: When you arrive at your destination, you may find that a lot of the attitudes and practices that you take for granted and consider "normal" are in fact peculiar to Irish culture
ga: Nuair a shroicheann tu do cheann scríbe b’fhéidir go n-aimseoidh tú go bhfuil mórán dearcaidh agus cleachtais go nglactar leo gan smaoineamh agus go meastar a bheith "coitianta" atá aisteach do chultúr na hÉireann

source: It can take time to settle into a new way of life
ga: Is féidir leis am a thógáil chun socrú isteach sa bhealach maireachtála nua

source: Whether you are planning to spend time travelling abroad or are moving to another country to work, our document on general tips for travelling abroad outlines what you need to do before you leave
ga: Cibé go bhfuil tú ag pleanáil taisteal thar lear nó bogadh go tír eile le hobair a dhéanamh, déanann ár ndoiciméad ar leideanna ginearálta do thaisteal thar lear cur síos ar an méid atá le déanamh agat sula n-imíonn tú

source: For example, you should apply for an Irish passport if you don’t have one already
ga: Mar shampla, ba chóir duit iarratas a dhéanamh ar phas Éireannach mura bhfuil ceann agat cheana féin

source: It is important to consider what the health issues are
ga: Tá sé tábhachtach na saincheisteanna sláinte a thógáil san áireamh

source: If you are going to the European Economic Area (EEA) or Switzerland to travel or look for work you should get the European Health Insurance Card
ga: Má tá tú ag dul chuig an Limistéar Eorpach Eacnamaíoch (LEE) nó chun na hEilvéise ag taisteal nó ag cuardach oibre, ba chóir duit Cárta Eorpach Árachas Sláinte a fháil

source: If you are travelling outside the EEA, you are strongly advised to seek specific holiday or health insurance before you travel and you should also check if you need to get vaccinations
ga: Má tá tú ag taisteal lasmuigh den LEE, moltar go láidir duit árachas saoire nó sláinte ar leith a fháil roimh thaisteal agus ba chóir duit seiceáil an bhfuil vacsaíní ag teastáil

source: You can check whether you can use or exchange your Irish driving licence when you move abroad
ga: Ba chóir duit seiceáil an bhféadfá do cheadúnas tiomána Éireannach a úsáid nó a mhalartú nuair a bhogann tú thar lear

source: Before you leave you should check our documents on useful documentation to bring and diplomatic supports for Irish people abroad
ga: Roimh a fhágann tú, ba chóir na doiciméid atá againn a sheiceáil ar cáipéisíocht úsáideach le tabhairt leat agus tacaí taidhleoireachta d’Éireannaigh thar lear

source: Crosscare Migrant Project has published a leaflet, What to consider when emigrating (pdf)
ga: D'fhoilsigh Crosscare Migrant Project bileog, What to consider when emigrating (pdf)

source: Whether you are planning to work within the European Union (EU) or work in a country outside the EU, you may find advertisements for jobs abroad in Irish and foreign newspapers as well as on job websites
ga: Má tá Éire á fágáil agat chun obair a chuardach i dtír eile, d’fhéadfá a bheith ag pleanáil oibriú laistigh den Aontas Eorpach (AE) nó d’fhéadfá a bheith ag dul chun oibriú i dtír lasmuigh AE

source: It has information on a range of topics including residence formalities and travel
ga: Aontas Eorpach: Is féidir leat fáil amach faoi obair agus scoir san AE ar europa.ie

source: If you are planning to work in the EU you should also check with your local employment services office or Intreo centre
ga: Tá faisnéis faoi réimse topaicí, foirmiúlachtaí cónaitheachta agus taistil san áireamh, annMá tá tú ag pleanáil oibriú san AE, ba chóir duit seiceáil le d’oifig seirbhísí fostaíochta áitiúil freisin

source: Each office has a EURES noticeboard advertising vacancies from a range of European countries
ga: Tá clár fógraí EURES ag gach oifig a fhógraíonn folúntais ó raon tíortha Eorpacha

source: If you are interested in working as a volunteer in another country there is information here about volunteering opportunities abroad
ga: Má tá suim agat oibriú mar oibrí deonach i dtír eile, tá eolas ann faoi dheiseanna in obair dheonach thar lear

source: If you leave Ireland to live or work in another country or if you are returning to your own country having worked in Ireland you may be entitled to receive social security benefits in the country you are moving to
ga: Má fhágann tú Éire chun cónaí nó oibriú i dtír eile nó má fhilleann tú ar do thír tar éis oibriú in Éirinn, d’fhéadfá a bheith i dteideal sochair slándála sóisialaí a fháil sa tír in bhfuil tú ag bogadh

source: You can find information about it in our document on social security arrangements between Ireland and other countries
ga: Is féidir leat tuilleadh eolais a fháil faoin ábhar seo inár ndoiciméad socruithe slándála na hÉireann le tíortha eile

source: If you leave your employment to work as a volunteer development worker you may be entitled to credited social security contributions
ga: Má fhágann tú d’fhostaíocht chun oibriú mar oibrí forbartha deonaí, d’fhéadfá a bheith i dteideal do ranníocaíochtaí creidiúnaithe slándála sóisialaí
